Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles Class
 The TeklaStructuresFiles class is for the paths where the attributes file will be searched for.
Inheritance Hierarchy
System.Object
 Tekla.Structures.TeklaStructuresFiles
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class TeklaStructuresFiles
Public Class TeklaStructuresFiles
The TeklaStructuresFiles type exposes the following members.
Constructors
Name | Description
TeklaStructuresFiles
 Initializes a new instance of the TeklaStructuresFiles class.
Top
Properties
Name | Description
PropertyFileDirectories
 The directories where to look for property files.
Top
Methods
Name | Description
GetAttributeFile(String)
 Gets a file info representing the first match in the standard property file directories.
GetAttributeFile(List<String>, String)
 Gets a file info representing the first match in the search directories.
GetFileDictionaryByExtension
 Retrieves a dictionary of file names and their corresponding paths from multiple directories.
GetMultiDirectoryFileList
 Gets a list of files with the given extension from the default search directories.
Top
See Also
Reference
Tekla.Structures Namespace